**Task 1:**
1. Read a Data Set Oil.CSV
2. Find out the first and last 5 days average oil price
3. Find out only January, 2017 average oil price

In [1]:
import numpy as np
import pandas as pd
oil_data = pd.read_csv('data/retail/oil.csv', index_col='date', parse_dates=True)
price = oil_data['dcoilwtico']
print(price.iloc[1:6].mean())
print(price.iloc[-5:].mean())
print(price.loc['2017-01'].mean())

93.128
46.745999999999995
52.504

**Task 2**
1. First, can you get me the 10 lowest prices from the data, sorted by date, starting with the most recent and ending with the oldest?
2. After that, return to the original data. I’ve provided a list of dates I want to narrow down to, and I also want to look only at prices less than or equal to 50 dollars per barrel.

In [2]:
print(price.sort_values()[:10].sort_index(ascending=False))
given_dates = ['2016-03-13', '2016-05-14', '2016-08-17', '2017-03-12', '2011-03-17']
mask = (price.loc[['2016-01-04', '2016-05-12', '2017-03-07']] <= 50)
mask

date
2016-02-16    29.05
2016-02-12    29.32
2016-02-11    26.19
2016-02-10    27.54
2016-02-09    27.96
2016-01-26    29.54
2016-01-21    29.55
2016-01-20    26.68
2016-01-19    28.47
2016-01-15    29.45
Name: dcoilwtico, dtype: float64

date
2016-01-04     True
2016-05-12     True
2017-03-07    False
Name: dcoilwtico, dtype: bool

**Task 3**
1. I noticed that two prices (51.44, 47.83), were incorrect, so I had them filled in with missing values. I’m not sure if I did this correctly. Can you confirm the number of missing values in the price column?
2. Once you’ve done that, fill the prices in with the median of the oil price series.

In [3]:
oil_series = pd.read_csv('data/retail/oil.csv', index_col='date', parse_dates=True)
oil_series = oil_series['dcoilwtico']
print(oil_series)

oil_series = oil_series.where(~oil_series.isin([51.44, 47.83]), pd.NA)
print(oil_series.isna().sum())

oil_series = oil_series.fillna(oil_series.median())
print(oil_series.isna().sum())

date
2013-01-01      NaN
2013-01-02    93.14
2013-01-03    92.97
2013-01-04    93.12
2013-01-07    93.20
              ...
2017-08-25    47.65
2017-08-28    46.40
2017-08-29    46.46
2017-08-30    45.96
2017-08-31    47.26
Name: dcoilwtico, Length: 1218, dtype: float64
45
0

**Task 4**
1. Write a function that outputs ‘buy’ if price is less than the 90th percentile and ‘wait’ if it’s not. Apply it to the oil series.
2. Then, I need to fix two final prices. Create a series that multiplies price by .55 if the date is ‘2016-12-23’ or ‘2017-05- 10’, and 1.1 for all other dates.

In [4]:
oil_series.apply(lambda x: 'Buy' if x < oil_series.quantile(0.75) else 'Wait').head(20)

date
2013-01-01     Buy
2013-01-02     Buy
2013-01-03     Buy
2013-01-04     Buy
2013-01-07     Buy
2013-01-08     Buy
2013-01-09     Buy
2013-01-10     Buy
2013-01-11     Buy
2013-01-14     Buy
2013-01-15     Buy
2013-01-16     Buy
2013-01-17    Wait
2013-01-18    Wait
2013-01-21     Buy
2013-01-22    Wait
2013-01-23     Buy
2013-01-24    Wait
2013-01-25     Buy
2013-01-28    Wait
Name: dcoilwtico, dtype: object

In [5]:
pd.Series(
    np.where(
        oil_series.index.isin(['2016-12-23', '2017-05-10']),
        oil_series * 0.9,
        oil_series * 1.1
    )
)

0        58.509
1       102.454
2       102.267
3       102.432
4       102.520
         ...
1213     52.415
1214     51.040
1215     51.106
1216     50.556
1217     51.986
Length: 1218, dtype: float64

In [6]:
oil_series

date
2013-01-01    53.19
2013-01-02    93.14
2013-01-03    92.97
2013-01-04    93.12
2013-01-07    93.20
              ...
2017-08-25    47.65
2017-08-28    46.40
2017-08-29    46.46
2017-08-30    45.96
2017-08-31    47.26
Name: dcoilwtico, Length: 1218, dtype: float64

**Task 5**
1. Read a CSV File "transaction.csv"
2. I need some help analyzing our transactions to make sure there aren’t any irregularities in the numbers. The data is stored in data/retail/transactions.csv... Can you read this data in and remind me how many rows are in the data, which columns are in the data, and their datatypes?

In [11]:
transaction_df = pd.read_csv('data/retail/transactions.csv')
print(transaction_df)
print(transaction_df.dtypes)

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]
date            object
store_nbr        int64
transactions     int64
dtype: object

**Task 6**
1. Can you dive a bit more deeply into the retail data and check if there are any missing values?
2. What about the number of unique dates? I want to make sure we didn’t leave any out.
3. Finally, can you report the mean, median, min and max of “transactions”? I want to check for any anomalies in our data.

In [16]:
print(transaction_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB
None

In [19]:
transaction_df.describe(include='all').round(2)

              date  store_nbr  transactions
count        83488   83488.00      83488.00
unique        1682        NaN           NaN
top     2017-08-15        NaN           NaN
freq            54        NaN           NaN
mean           NaN      26.94       1694.60
std            NaN      15.61        963.29
min            NaN       1.00          5.00
25%            NaN      13.00       1046.00
50%            NaN      27.00       1393.00
75%            NaN      40.00       2079.00
max            NaN      54.00       8359.00

In [17]:
print(transaction_df.isnull())

        date  store_nbr  transactions
0      False      False         False
1      False      False         False
2      False      False         False
3      False      False         False
4      False      False         False
...      ...        ...           ...
83483  False      False         False
83484  False      False         False
83485  False      False         False
83486  False      False         False
83487  False      False         False

[83488 rows x 3 columns]

In [18]:
print(transaction_df.isnull().sum())

date            0
store_nbr       0
transactions    0
dtype: int64

In [23]:
transaction_df.nunique()

date            1682
store_nbr         54
transactions    4993
dtype: int64

In [24]:
transaction_df["transactions"]

0         770
1        2111
2        2358
3        3487
4        1922
         ...
83483    2804
83484    1573
83485    2255
83486     932
83487     802
Name: transactions, Length: 83488, dtype: int64

In [25]:
transaction_df["transactions"].mean()

1694.6021583940208

In [26]:
transaction_df["transactions"].median()

1393.0

In [27]:
transaction_df["transactions"].min()

5

In [28]:
transaction_df["transactions"].max()

8359

**Task 7**
1. Can you get me a copy of the DataFrame that excludes first row, and only includes “store_nbr” and “transactions”?
2. Also, can you report the number of unique store numbers?
3. Finally, report the total number of transactions in millions.

In [29]:
transaction_df.loc[1:, ["store_nbr", "transactions"]]

       store_nbr  transactions
1              1          2111
2              2          2358
3              3          3487
4              4          1922
5              5          1903
...          ...           ...
83483         50          2804
83484         51          1573
83485         52          2255
83486         53           932
83487         54           802

[83487 rows x 2 columns]

In [30]:
transaction_df["store_nbr"].nunique()

54

In [31]:
transaction_df["transactions"].sum()

141478945

**Task 8**
1. Can you drop the first row of data this time? A slice is fine for viewing but we want this permanently removed.
2. Also, drop the date column, but not in place.
3. Then, can you get me a DataFrame that includes only the last row for each of our stores? I want to take a look at the most recent data for each.

In [44]:
retail_df = pd.read_csv('data/retail/transactions.csv')
retail_df.drop(range(1), axis=0, inplace=True).head()
retail_df.drop(subset='date')
retail_df.drop_duplicates(keep="last", ignore_index=True)

AttributeError: 'NoneType' object has no attribute 'head'

In [45]:
tran = pd.read_csv('data/retail/transactions.csv')
tran.drop([0], axis=0, inplace=True).head()
tran.drop("date", axis=1).head()
tran.drop_duplicates(subset = 'store_nbr', keep="last", ignore_index = True)

AttributeError: 'NoneType' object has no attribute 'head'

**Task 9**
1. Read oil data - 'data/retail/oil.csv'
2. Can you tell if any dates or prices are missing?
3. I’d like to see the mean oil price if we fill in the missing values with 0 
4. Compare it to the mean oil price if we fill them in with the mean.

In [46]:
oil_df = pd.read_csv('data/retail/oil.csv')
oil_df

            date  dcoilwtico
0     2013-01-01         NaN
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1218 rows x 2 columns]

In [49]:
oil_df["date"].isnull().sum()

0

In [52]:
oil_df["dcoilwtico"].isnull().sum()

43

In [53]:
oil_df.isna().sum()

date           0
dcoilwtico    43
dtype: int64

In [54]:
oil_df["dcoilwtico"].fillna(0).mean()

65.32379310344835

In [55]:
oil_df["dcoilwtico"].fillna(oil_df["dcoilwtico"].mean()).mean()

67.71436595744696

**Task 10**
1. Read Dataset: Transactions 'data/retail/transactions.csv'
2. First, calculate the percentage of times ALL stores had more than 2000 transactions
3. Then, calculate the percentage of times store 25 had more than 2000 transactions, and calculate the sum of transactions on these days
4. Finally, sum the transactions for stores 25 and 3, that occurred in May or June, and had less than 2000 transactions

In [59]:
retail_df = pd.read_csv('data/retail/transactions.csv')
retail_df

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [61]:
retail_df.loc[retail_df["transactions"]>2000]

             date  store_nbr  transactions
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
6      2013-01-02          6          2143
8      2013-01-02          8          3250
...           ...        ...           ...
83480  2017-08-15         47          3581
83481  2017-08-15         48          2722
83482  2017-08-15         49          2814
83483  2017-08-15         50          2804
83485  2017-08-15         52          2255

[22275 rows x 3 columns]

In [66]:
condition = (retail_df["store_nbr"]>25) & (retail_df["transactions"]>2000)
retail_df.loc[condition]

             date  store_nbr  transactions
30     2013-01-02         34          2724
38     2013-01-02         44          4821
39     2013-01-02         45          4208
40     2013-01-02         46          4886
41     2013-01-02         47          4161
...           ...        ...           ...
83480  2017-08-15         47          3581
83481  2017-08-15         48          2722
83482  2017-08-15         49          2814
83483  2017-08-15         50          2804
83485  2017-08-15         52          2255

[13701 rows x 3 columns]

**Task 11**
1. Dataset: Transactions 'data/retail/transactions.csv'
2. Can you get me a dataset that includes the 5 days with the highest transactions counts? Any similarities between them?
3. Then, can you get me a dataset sorted by date from earliest to most recent, but with the highest transactions first and the lowest transactions last for each day?
4. Finally, sort the columns in reverse alphabetical order.

In [75]:
retail_df = pd.read_csv('data/retail/transactions.csv')
retail_df.nlargest(5, "transactions", keep='first')

             date  store_nbr  transactions
52011  2015-12-23         44          8359
71010  2016-12-23         44          8307
16570  2013-12-23         44          8256
33700  2014-12-23         44          8120
16572  2013-12-23         46          8001

In [76]:
retail_df.sort_values(by='transactions', ascending=False, na_position='first')

             date  store_nbr  transactions
52011  2015-12-23         44          8359
71010  2016-12-23         44          8307
16570  2013-12-23         44          8256
33700  2014-12-23         44          8120
16572  2013-12-23         46          8001
...           ...        ...           ...
58003  2016-04-18         53            54
57950  2016-04-17         53            33
52428  2016-01-04          1            10
52392  2016-01-02          2             6
65479  2016-09-07         43             5

[83488 rows x 3 columns]

In [87]:
retail_df.sort_values(['store_nbr', 'transactions'],ascending = [False, False])

             date  store_nbr  transactions
33757  2014-12-24         54          1811
71072  2016-12-24         54          1807
16625  2013-12-24         54          1756
52073  2015-12-24         54          1726
71390  2016-12-31         54          1647
...           ...        ...           ...
44833  2015-08-09          1           376
1795   2013-02-10          1           374
49212  2015-11-01          1           369
19682  2014-03-02          1           346
52428  2016-01-04          1            10

[83488 rows x 3 columns]

**Task 11**
1. *Dataset: Transactions 'data/retail/transactions.csv'*<br>
2.  Can you send me the transaction data with the columns renamed? - transactions -> transaction_count, store_nbr -> store_number
3. I want them looking a bit prettier for my presentation – you can find more details in the notebook.
3. Also, could you reorder the columns so date is first, then transaction count, then store number?

In [88]:
retail_df = pd.read_csv('data/retail/transactions.csv')
retail_df.rename(columns={'transactions':'transaction_count', 'store_nbr':'store_number'})

             date  store_number  transaction_count
0      2013-01-01            25                770
1      2013-01-02             1               2111
2      2013-01-02             2               2358
3      2013-01-02             3               3487
4      2013-01-02             4               1922
...           ...           ...                ...
83483  2017-08-15            50               2804
83484  2017-08-15            51               1573
83485  2017-08-15            52               2255
83486  2017-08-15            53                932
83487  2017-08-15            54                802

[83488 rows x 3 columns]

In [91]:
retail_df = pd.read_csv('data/retail/transactions.csv')
retail_df.rename(columns=lambda x:x.upper())

             DATE  STORE_NBR  TRANSACTIONS
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [93]:
retail_df.reindex(labels=["date","transactions","store_nbr"],axis=1)

             date  transactions  store_nbr
0      2013-01-01           770         25
1      2013-01-02          2111          1
2      2013-01-02          2358          2
3      2013-01-02          3487          3
4      2013-01-02          1922          4
...           ...           ...        ...
83483  2017-08-15          2804         50
83484  2017-08-15          1573         51
83485  2017-08-15          2255         52
83486  2017-08-15           932         53
83487  2017-08-15           802         54

[83488 rows x 3 columns]